rails/app/serializers/episode_serializer.rb

  def characters
    episode = Episode.find(object.id)
    episode.characters.map do |character|
---
SELECT "episodes".* FROM "episodes" WHERE "episodes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "characters".* FROM "characters" INNER JOIN "characters_episodes" ON "characters"."id" = "characters_episodes"."character_id" WHERE "characters_episodes"."episode_id" = ?  [["episode_id", 1]]