rails/app/controllers/v1/characters_controller.rb

    def set_character
      @character = Character.find(params[:id])
---
SELECT "characters".* FROM "characters" WHERE "characters"."id" = $1 LIMIT $2  [["id", 51], ["LIMIT", 1]]