rails/app/controllers/v1/episodes_controller.rb

SELECT "episodes".* FROM "episodes" WHERE "episodes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_episode
      @episode = Episode.find(params[:id])