rails/app/controllers/v1/locations_controller.rb

INSERT INTO "locations" ("name", "location_type", "dimension", "url") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "\"\""], ["location_type", "\"\""], ["dimension", "\"\""], ["url", "\"\""]]
---
    def create
      @location = Location.create!(location_params)