app/serializers/character_serializer.rb

SELECT "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def location
    location = Location.find(object.location_id)

SELECT "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def origin
    origin = Location.find(object.origin_id)

SELECT "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "episodes".* FROM "episodes" INNER JOIN "characters_episodes" ON "episodes"."id" = "characters_episodes"."episode_id" WHERE "characters_episodes"."character_id" = ?  [["character_id", 1]]
---
  def episode
    character = Character.find(object.id)
    character.episodes.map do |episode|