app/serializers/location_serializer.rb

SELECT "locations".* FROM "locations" WHERE "locations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def residents
    location = Location.find(object.id)