app/kafka/transformer_topic_consumer.rb

INSERT INTO "characters" ("name", "status", "species", "character_type", "gender", "image", "location_id", "origin_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"  [["name", "\"my name\""], ["status", "\"\""], ["species", "\"\""], ["character_type", "\"\""], ["gender", "\"\""], ["image", "\"\""], ["location_id", 1], ["origin_id", 1]]
---
  def create(data)
    @character = Character.create!(data)